1password.op-vscode
anthropic.claude-code
ardenivanov.svelte-intellisense
bastndev.lynx-theme
biomejs.biome
bradlc.vscode-tailwindcss
eamodio.gitlens
esbenp.prettier-vscode
fivethree.vscode-svelte-snippets
formulahendry.auto-close-tag
ggml-org.llama-vscode
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
ms-azuretools.vscode-containers
ms-vscode-remote.remote-containers
rvest.vs-code-prettier-eslint
stivo.tailwind-fold
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
usernamehw.errorlens
vercel.turbo-vsc
vscode-icons-team.vscode-icons
