eamodio.gitlens
formulahendry.auto-close-tag
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
ms-vscode-remote.remote-containers
rooveterinaryinc.roo-cline
saoudrizwan.claude-dev
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vscode-icons-team.vscode-icons
