tap "homebrew/bundle"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow"
brew "openssl@1.1"
brew "python@3.11"
brew "legit"
brew "mas"
brew "node"
brew "nvm"
brew "pnpm"
brew "rcm"
brew "rust"
brew "trash"
brew "tree"
brew "wget"
brew "yarn"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "cleanmymac"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "orbstack"
cask "visual-studio-code"
mas "Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "1YiB.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "aeschli.vscode-css-formatter"
vscode "alexkrechik.cucumberautocomplete"
vscode "andys8.jest-snippets"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-preview-github-styles"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "csstools.postcss"
vscode "dakshmiglani.hex-to-rgba"
vscode "Dart-Code.dart-code"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dozerg.tsimportsorter"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.vscode-rust-syntax"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gaetschwartz.build-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "gmlewis-vscode.flutter-stylizer"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "hdevalke.rust-test-lens"
vscode "IBM.output-colorizer"
vscode "jinxdash.prettier-rust"
vscode "jock.svg"
vscode "JScearcy.rust-doc-viewer"
vscode "kamikillerto.vscode-colorize"
vscode "kevinkyang.auto-comment-blocks"
vscode "kuscamara.remove-unused-imports"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "NachoDecima.custom-css-sorter"
vscode "naumovs.color-highlight"
vscode "nitayneeman.git-semantic-commit"
vscode "Orta.vscode-twoslash-queries"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "PolymerMallard.css-alphabetize"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "runem.lit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "serayuzgur.crates"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shuffle-dev.shuffle-dev"
vscode "SimonSiefke.svg-preview"
vscode "snappify.snappify"
vscode "steoates.autoimport"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "Swellaby.vscode-rust-test-adapter"
vscode "Tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "wk-j.save-and-run"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
vscode "ZixuanChen.vitest-explorer"
