tap "menubar-apps/menubar-apps"
brew "bat"
brew "node"
brew "bruno-cli"
brew "container", link: false
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "go"
brew "mas"
brew "nvm"
brew "opencode"
brew "pnpm"
brew "podman"
brew "pyenv"
brew "syncthing"
brew "tree"
brew "yq"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "aldente"
cask "alfred"
cask "bartender"
cask "bruno"
cask "container"
cask "cyberduck"
cask "font-fira-code"
cask "font-iosevka"
cask "font-meslo-for-powerlevel10k"
cask "ghostty"
cask "google-chrome"
cask "home-assistant"
cask "iterm2"
cask "lulu"
cask "obsidian"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "soundsource"
cask "tableplus"
cask "time-out"
cask "visual-studio-code"
cask "zed"
cask "zen"
mas "Brother P-touch Editor", id: 1453365242
mas "Health Auto Export", id: 1115567069
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Session", id: 1521432881
vscode "1password.op-vscode"
vscode "anthropic.claude-code"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "ms-vscode-remote.remote-containers"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
go "github.com/cosmtrek/air"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/charmbracelet/glow"
go "github.com/melkeydev/go-blueprint"
go "github.com/ramya-rao-a/go-outline"
go "github.com/kevincobain2000/gobrew/cmd/gobrew"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/mitranim/gow"
go "github.com/gowebly/gowebly"
go "github.com/rakyll/hey"
go "github.com/josharian/impl"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/vektra/mockery/v2"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
