# Brewfile.base - Shared packages for all environments
# This file is included by both Brewfile.personal and Brewfile.work

# Taps (third-party repositories)
tap "charmbracelet/tap"                 # Charm tools (TUI libraries and apps)
tap "homebrew/autoupdate"               # Automatic Homebrew updates
tap "menubar-apps/menubar-apps"         # macOS menubar applications

# CLI Tools and Libraries
brew "bat"                              # Cat clone with syntax highlighting
brew "eza"                              # Modern replacement for ls
brew "fzf"                              # Fuzzy finder for command line
brew "gh"                               # GitHub CLI
brew "git"                              # Version control system
brew "git-extras"                       # Additional git commands
brew "glances"                          # System monitoring tool
brew "go"                               # Go programming language
brew "jq"                               # JSON processor
brew "mas"                              # Mac App Store CLI
brew "nvm"                              # Node.js version manager
brew "opencode"                         # AI coding assistant CLI
brew "pnpm"                             # Fast, disk-efficient npm alternative                          # Python version manager
brew "syncthing"                        # Continuous file synchronization
brew "tree"                             # Directory listing as tree
brew "yq"                               # YAML processor (like jq for YAML)
brew "zsh"                              # Z shell
brew "zsh-syntax-highlighting"          # Syntax highlighting for zsh

# Desktop Applications (Casks)
cask "bartender"                        # Menu bar icon manager
cask "bruno"                            # API client (Postman alternative)
cask "font-fira-code"                   # Monospace font with ligatures
cask "font-iosevka"                     # Monospace font for code
cask "font-meslo-for-powerlevel10k"     # Font for Powerlevel10k zsh theme
cask "ghostty"                          # GPU-accelerated terminal emulator
cask "google-chrome"                    # Google Chrome browser
cask "lulu"                             # macOS firewall
cask "obsidian"                         # Markdown knowledge base
cask "tableplus"                        # Database management GUI
cask "time-out"                         # Break reminder app
cask "visual-studio-code"               # Code editor
cask "zen"                              # Privacy-focused Firefox fork
cask "zed"                              # Zed code editor

# Mac App Store Apps
mas "Irvue", id: 1039633667                   # Unsplash wallpapers
mas "Keynote", id: 409183694                  # Presentation software
mas "Numbers", id: 409203825                  # Spreadsheet software
mas "Pages", id: 409201541                    # Word processor
mas "Time Out", id: 402592703                 # Break reminder
mas "WireGuard", id: 1451685025               # WireGuard VPN client

# VS Code Extensions
vscode "alvinunreal.claude-vscode-theme"            # Claude-inspired theme
vscode "anthropic.claude-code"                      # Claude AI coding assistant
vscode "bierner.markdown-mermaid"                   # Mermaid diagrams in Markdown
vscode "christian-kohler.npm-intellisense"          # npm module autocomplete
vscode "christian-kohler.path-intellisense"         # File path autocomplete
vscode "davidanson.vscode-markdownlint"             # Markdown linting
vscode "dbaeumer.vscode-eslint"                     # ESLint integration
vscode "eamodio.gitlens"                            # Git supercharged
vscode "ecmel.vscode-html-css"                      # HTML/CSS support
vscode "editorconfig.editorconfig"                  # EditorConfig support
vscode "esbenp.prettier-vscode"                     # Prettier code formatter
vscode "formulahendry.auto-close-tag"               # Auto close HTML tags
vscode "formulahendry.auto-rename-tag"              # Auto rename paired HTML tags
vscode "github.copilot"                             # GitHub Copilot AI
vscode "github.copilot-chat"                        # Copilot chat interface
vscode "github.github-vscode-theme"                 # GitHub color themes
vscode "github.vscode-pull-request-github"          # GitHub PR integration
vscode "golang.go"                                  # Go language support
vscode "letmaik.git-tree-compare"                   # Git tree comparison
vscode "mikestead.dotenv"                           # .env file syntax
vscode "ms-vscode-remote.remote-containers"         # Dev Containers support
vscode "redhat.vscode-yaml"                         # YAML language support
vscode "streetsidesoftware.code-spell-checker"      # Spell checker
vscode "usernamehw.errorlens"                       # Inline error display
vscode "vscode-icons-team.vscode-icons"             # File icons
vscode "yoavbls.pretty-ts-errors"                   # Readable TypeScript errors
vscode "yzhang.markdown-all-in-one"                 # Markdown editing tools
vscode "zignd.html-css-class-completion"            # CSS class autocomplete

# Go Packages
go "github.com/a-h/templ/cmd/templ"                 # Templ HTML templating
go "github.com/charmbracelet/glow"                  # Markdown renderer
go "github.com/cosmtrek/air"                        # Live reload for Go apps
go "github.com/golang-migrate/migrate/v4/cmd/migrate" # Database migrations
go "github.com/golangci/golangci-lint/cmd/golangci-lint" # Go linter
go "github.com/kevincobain2000/gobrew/cmd/gobrew"   # Go version manager
go "github.com/mitranim/gow"                        # Go file watcher
go "github.com/rakyll/hey"                          # HTTP load generator
go "golang.org/x/tools/cmd/goimports"               # Go import formatter
go "golang.org/x/tools/gopls"                       # Go language server
go "honnef.co/go/tools/cmd/staticcheck"             # Go static analysis
