anthropic.claude-code
catppuccin.catppuccin-vsc-icons
christian-kohler.path-intellisense
davidbwaters.macos-modern-theme
dbaeumer.vscode-eslint
ecmel.vscode-html-css
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
golang.go
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
this-fifo.natty
usernamehw.errorlens
yoavbls.pretty-ts-errors
zignd.html-css-class-completion
