# Brewfile - All packages (merged from base, personal, work, and installed)
# Usage: brew bundle --file=Brewfile.installed

# Taps
tap "1password/tap"
tap "alexsjones/llmfit"
tap "arimxyer/tap"
tap "charmbracelet/tap"
tap "gromgit/brewtils"
tap "homebrew/autoupdate"
tap "menubar-apps/menubar-apps"
tap "nguyenphutrong/tap"
tap "oven-sh/bun"
tap "steipete/tap"

# CLI Tools
brew "aom"
brew "asdf"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "bruno-cli"
brew "container", link: false
brew "eza"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "glances"
brew "glib"
brew "glow"
brew "go"
brew "graphicsmagick"
brew "hcloud"
brew "homeassistant-cli"
brew "jpeg-xl"
brew "jq"
brew "lazygit"
brew "libheif"
brew "llmfit"
brew "mas"
brew "mole"
brew "neovim"
brew "node"
brew "nvm"
brew "opencode"
brew "pnpm"
brew "pyenv"
brew "shellcheck"
brew "starship"
brew "syncthing"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "uv"
brew "webp"
brew "yq"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "arimxyer/tap/models"
brew "charmbracelet/tap/crush"
brew "gromgit/brewtils/taproom"
brew "oven-sh/bun/bun"

# Desktop Applications (Casks)
cask "1password"
cask "1password-cli"
cask "aldente"
cask "alfred"
cask "bartender"
cask "bruno"
cask "container"
cask "cyberduck"
cask "font-fira-code"
cask "font-iosevka"
cask "font-meslo-for-powerlevel10k"
cask "ghostty"
cask "google-chrome"
cask "home-assistant"
cask "iterm2"
cask "lulu"
cask "meetingbar"
cask "obsidian"
cask "orbstack"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "session-manager-plugin"
cask "soundsource"
cask "tableplus"
cask "time-out"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
cask "zen"
cask "nguyenphutrong/tap/quotio"
cask "steipete/tap/codexbar"

# Mac App Store Apps
mas "Brother P-touch Editor", id: 1453365242
mas "Developer", id: 640199958
mas "Health Auto Export", id: 1115567069
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Session", id: 1521432881
mas "Tailscale", id: 1475387142
mas "Time Out", id: 402592703
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025

# VS Code Extensions
vscode "1password.op-vscode"
vscode "alvinunreal.claude-vscode-theme"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "letmaik.git-tree-compare"
vscode "mikestead.dotenv"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "this-fifo.natty"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"

# Go Packages
go "github.com/a-h/templ/cmd/templ"
go "github.com/charmbracelet/glow"
go "github.com/cosmtrek/air"
go "github.com/cweill/gotests/gotests"
go "github.com/fatih/gomodifytags"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/gowebly/gowebly"
go "github.com/haya14busa/goplay/cmd/goplay"
go "github.com/josharian/impl"
go "github.com/kevincobain2000/gobrew/cmd/gobrew"
go "github.com/leo/agent-tools"
go "github.com/leo/wt/cmd/wt"
go "github.com/leovanhaaren/go-maintain/cmd/jira-cli"
go "github.com/leovanhaaren/go-maintain/cmd/workflow"
go "github.com/leovanhaaren/taskdown/cmd/td"
go "github.com/melkeydev/go-blueprint"
go "github.com/mitranim/gow"
go "github.com/rakyll/hey"
go "github.com/ramya-rao-a/go-outline"
go "github.com/user/ccloop"
go "github.com/vektra/mockery/v2"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
